# LooseDimensionsForCurtainWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LooseDimensionFailures..::..LooseDimensionsForCurtainWall Property
BuiltInFailures..::..LooseDimensionFailures Class See Also
---
Switching wall type to Family Curtain Wall. All Dimension References to the side faces of the Wall will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LooseDimensionsForCurtainWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LooseDimensionsForCurtainWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LooseDimensionsForCurtainWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LooseDimensionFailures Class
Autodesk.Revit.DB Namespace